app/controllers/articles_controller.rb

	def create
	debugger
	@article = Article.new(article_params)
	@article.user = User.first
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1