app/controllers/articles_controller.rb

	def create
	debugger
	@article = Article.new(article_params)
	@article.user = curent_user
	if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is new article"], ["description", "This is description for new article"], ["created_at", "2016-02-02 06:05:59.388520"], ["updated_at", "2016-02-02 06:05:59.388520"]]

	def update

		if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "This is my second description EDITED"], ["updated_at", "2016-02-02 07:03:00.892879"], ["id", 2]]