app/controllers/users_controller.rb

def update
if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Prashant123"], ["email", "prashant22344@example.com"], ["updated_at", "2016-02-04 07:56:30.132002"], ["id", 6]]

def show
	@user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 5 OFFSET 0  [["user_id", 9]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]